In [2]:
import pandas as pd
import numpy as np
import math

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

# Question 1

In [4]:
res = pd.DataFrame(df)
res

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
missing = np.where(df["FlightNumber"].isnull() == True)
missing

(array([1, 3], dtype=int64),)

In [6]:
for i in missing:
    df['FlightNumber'][i] = df['FlightNumber'][i-1]+10

C:\Users\Santosh\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [8]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [9]:
df["FlightNumber"] = df["FlightNumber"].astype(int)

In [10]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

# Question 2

In [11]:
l=[]
r=[]
for s in df['From_To']:
    l.append(s.split(sep='_',maxsplit=1)[0])
    r.append(s.split(sep='_',maxsplit=1)[1])

In [12]:
l

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [13]:
r

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [14]:
df['From'] = l
df['To']= r

In [15]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

# Question 3

In [16]:
df['From'] = df['From'].str.capitalize()
df['To'] = df['To'].str.capitalize()
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

# Question 4

In [17]:
df=df.drop("From_To",axis=1)

In [18]:
#From and TO columns are attached in the Question2 itself

# Question 5

In [19]:
delays = pd.DataFrame(df['RecentDelays'])

In [24]:
l=list(df['RecentDelays'])
l

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [83]:
lis2= []
for i in df['RecentDelays']:
    lis2.append(len(i))
lis2

[2, 0, 3, 1, 2]

In [84]:
n=max(lis2)
n

3

In [85]:
lis3=[]

In [86]:
i=0;
while i<n:
    for a in l:
        try:
            lis3.append(a[i])
        except:
            lis3.append(np.nan)
    i=i+1
            
lis4= []
lis3

[23, nan, 24, 13, 67, 47, nan, 43, nan, 32, nan, nan, 87, nan, nan]

In [87]:
lis4.append(lis3[0:len(l)])

In [78]:
lis4

[[23, nan, 24, 13, 67],
 [47, nan, 43, nan, 32],
 [nan,
  nan,
  87,
  nan,
  nan,
  23,
  nan,
  24,
  13,
  67,
  47,
  nan,
  43,
  nan,
  32,
  nan,
  nan,
  87,
  nan,
  nan,
  23,
  nan,
  24,
  13,
  67,
  47,
  nan,
  43,
  nan,
  32,
  nan,
  nan,
  87,
  nan,
  nan],
 [23, nan, 24, 13, 67]]

In [88]:
lis4.append(lis3[len(l):len(l)+len(l)])
lis4.append(lis3[len(l)+len(l):len(lis3)])

In [89]:
lis4

[[23, nan, 24, 13, 67], [47, nan, 43, nan, 32], [nan, nan, 87, nan, nan]]

In [91]:
for i,x in enumerate(lis4):
    print(i,x)

0 [23, nan, 24, 13, 67]
1 [47, nan, 43, nan, 32]
2 [nan, nan, 87, nan, nan]

In [92]:
df2=pd.DataFrame({'delay_1':lis4[0],'delay_2':lis4[1],'delay_3':lis4[2]})

In [93]:
df2

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [98]:
df=pd.concat([df,df2],axis=1)
df

,FlightNumber,delays,Airline,From,To,delay_1,delay_2,delay_3,delay_1,delay_2,delay_3,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN,23.0,47.0,NaN,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0,24.0,43.0,87.0,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN,13.0,NaN,NaN,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN,67.0,32.0,NaN,67.0,32.0,NaN